# Pandas

Herramienta de manipulación de datos de alto nivel, construida sobre Numpy y permite el análisis y limpieza de datos en bruto.

Los principales tipos de datos que pueden representarse con pandas son:

* Datos tabulares que tienen columnas de tipo heterogéneo con etiquetas en columnas y filas.
* Series temporales

Permite leer y escribir datos en diferentes formatos como lo son: CSV, JSON, Excel, bases SQL

Se instala empleando

* pip install pandas
* conda install pandas

# Manipulación de datos con pandas

In [1]:
# Importar librerias
import pandas as pd # Importar pandas
import numpy  as np # Importar numpy

In [4]:
# Leer archivos separados por comas, extension .csv
df = pd.read_csv('../data/Phone.csv')
df.head(5) ## mostrar primeros 5 registros

    Income Phone_type  Class_type
0  89800.0    Android      Luxury
1  47500.0    Android  Non-Luxury
2  45000.0     iPhone      Luxury
3  44700.0        NaN      Luxury
4  59500.0     iPhone      Luxury

In [5]:
# Query 
df.query('Income > 10000')

      Income Phone_type  Class_type
0    89800.0    Android      Luxury
1    47500.0    Android  Non-Luxury
2    45000.0     iPhone      Luxury
3    44700.0        NaN      Luxury
4    59500.0     iPhone      Luxury
6    63300.0     iPhone  Non-Luxury
7    52900.0    Android      Luxury
8    78200.0    Android      Luxury
9   145100.0     iPhone      Luxury
10   88600.0     iPhone  Non-Luxury
11   65600.0     iPhone      Luxury
13   94600.0    Android      Luxury
14   59400.0     iPhone      Luxury
15   47300.0     iPhone  Non-Luxury
16   72100.0        NaN      Luxury
19   83000.0     iPhone      Luxury
20   64100.0    Android  Non-Luxury
21   42100.0     iPhone  Non-Luxury
23   91500.0     iPhone  Non-Luxury
24   51200.0    Android      Luxury
25   13800.0     iPhone  Non-Luxury
26   47500.0     iPhone  Non-Luxury

In [6]:
# dimensiones del dataframe
df.shape

(27, 3)

In [7]:
# Información general del data frame
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27 entries, 0 to 26
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Income      25 non-null     float64
 1   Phone_type  25 non-null     object
 2   Class_type  27 non-null     object
dtypes: float64(1), object(2)
memory usage: 780.0+ bytes

In [8]:
# Tipos de datos que existen en las columnas del dataframe
df.dtypes

Income        float64
Phone_type     object
Class_type     object
dtype: object

El metodo .describe() de los dataframes muestra un resumen de la estadistica descriptiva general de las columnas numericas del dataframe.

* Promedio (mean)
* Desviacion estandard (std)
* Valor minimo
* Valor maximo
* Cuartiles (25%, 50% y 75%)

In [9]:
df.describe() # Nos muestra la informacion de las columnas númericas

              Income
count      25.000000
mean    57872.000000
std     33170.085921
min         0.000000
25%     45000.000000
50%     59400.000000
75%     78200.000000
max    145100.000000

In [10]:
df.describe(include=['O']) # Mostrar variables categoricas

       Phone_type Class_type
count          25         27
unique          2          2
top        iPhone     Luxury
freq           15         15

## Seleccion e Indexación

In [13]:
# Regresara todos los datos de la columna Phone_type
df['Phone_type']

0     Android
1     Android
2      iPhone
3         NaN
4      iPhone
5     Android
6      iPhone
7     Android
8     Android
9      iPhone
10     iPhone
11     iPhone
12    Android
13    Android
14     iPhone
15     iPhone
16        NaN
17     iPhone
18    Android
19     iPhone
20    Android
21     iPhone
22     iPhone
23     iPhone
24    Android
25     iPhone
26     iPhone
Name: Phone_type, dtype: object

In [15]:
df.Phone_type

0     Android
1     Android
2      iPhone
3         NaN
4      iPhone
5     Android
6      iPhone
7     Android
8     Android
9      iPhone
10     iPhone
11     iPhone
12    Android
13    Android
14     iPhone
15     iPhone
16        NaN
17     iPhone
18    Android
19     iPhone
20    Android
21     iPhone
22     iPhone
23     iPhone
24    Android
25     iPhone
26     iPhone
Name: Phone_type, dtype: object

In [14]:
# Seleccionar dos o mas columnas

df[['Phone_type','Income']]

   Phone_type    Income
0     Android   89800.0
1     Android   47500.0
2      iPhone   45000.0
3         NaN   44700.0
4      iPhone   59500.0
5     Android       NaN
6      iPhone   63300.0
7     Android   52900.0
8     Android   78200.0
9      iPhone  145100.0
10     iPhone   88600.0
11     iPhone   65600.0
12    Android       NaN
13    Android   94600.0
14     iPhone   59400.0
15     iPhone   47300.0
16        NaN   72100.0
17     iPhone       0.0
18    Android       0.0
19     iPhone   83000.0
20    Android   64100.0
21     iPhone   42100.0
22     iPhone       0.0
23     iPhone   91500.0
24    Android   51200.0
25     iPhone   13800.0
26     iPhone   47500.0

In [16]:
## Crear una nueva columna

df['Income_Descuento'] = df.Income * 0.20
df.head()

    Income Phone_type  Class_type  Income_Descuento
0  89800.0    Android      Luxury           17960.0
1  47500.0    Android  Non-Luxury            9500.0
2  45000.0     iPhone      Luxury            9000.0
3  44700.0        NaN      Luxury            8940.0
4  59500.0     iPhone      Luxury           11900.0

In [21]:
df.drop('Income_Descuento',axis=1) # axis = 0 elimina filas(index) axis = 1 elimina columnas

      Income Phone_type  Class_type
0    89800.0    Android      Luxury
1    47500.0    Android  Non-Luxury
2    45000.0     iPhone      Luxury
3    44700.0        NaN      Luxury
4    59500.0     iPhone      Luxury
5        NaN    Android  Non-Luxury
6    63300.0     iPhone  Non-Luxury
7    52900.0    Android      Luxury
8    78200.0    Android      Luxury
9   145100.0     iPhone      Luxury
10   88600.0     iPhone  Non-Luxury
11   65600.0     iPhone      Luxury
12       NaN    Android  Non-Luxury
13   94600.0    Android      Luxury
14   59400.0     iPhone      Luxury
15   47300.0     iPhone  Non-Luxury
16   72100.0        NaN      Luxury
17       0.0     iPhone  Non-Luxury
18       0.0    Android      Luxury
19   83000.0     iPhone      Luxury
20   64100.0    Android  Non-Luxury
21   42100.0     iPhone  Non-Luxury
22       0.0     iPhone      Luxury
23   91500.0     iPhone  Non-Luxury
24   51200.0    Android      Luxury
25   13800.0     iPhone  Non-Luxury
26   47500.0     iPhone  Non-Luxury

In [22]:
df.head()

    Income Phone_type  Class_type  Income_Descuento
0  89800.0    Android      Luxury           17960.0
1  47500.0    Android  Non-Luxury            9500.0
2  45000.0     iPhone      Luxury            9000.0
3  44700.0        NaN      Luxury            8940.0
4  59500.0     iPhone      Luxury           11900.0

In [23]:
# Para que quede grabado

# df = df.drop('Income_Descuento',axis=1) # Forma 1
df.drop('Income_Descuento', axis=1, inplace=True) # Forma 2

In [24]:
df.head()

    Income Phone_type  Class_type
0  89800.0    Android      Luxury
1  47500.0    Android  Non-Luxury
2  45000.0     iPhone      Luxury
3  44700.0        NaN      Luxury
4  59500.0     iPhone      Luxury

In [25]:
df.columns # nombres de las columnas

Index(['Income', 'Phone_type', 'Class_type'], dtype='object')

In [26]:
df.index # nombres de los indices

RangeIndex(start=0, stop=27, step=1)

## Filtros

In [30]:
# seleccionar todas las filas donde el valor Income sea mayor que 0
df[df['Income']>0]

      Income Phone_type  Class_type
0    89800.0    Android      Luxury
1    47500.0    Android  Non-Luxury
2    45000.0     iPhone      Luxury
3    44700.0        NaN      Luxury
4    59500.0     iPhone      Luxury
6    63300.0     iPhone  Non-Luxury
7    52900.0    Android      Luxury
8    78200.0    Android      Luxury
9   145100.0     iPhone      Luxury
10   88600.0     iPhone  Non-Luxury
11   65600.0     iPhone      Luxury
13   94600.0    Android      Luxury
14   59400.0     iPhone      Luxury
15   47300.0     iPhone  Non-Luxury
16   72100.0        NaN      Luxury
19   83000.0     iPhone      Luxury
20   64100.0    Android  Non-Luxury
21   42100.0     iPhone  Non-Luxury
23   91500.0     iPhone  Non-Luxury
24   51200.0    Android      Luxury
25   13800.0     iPhone  Non-Luxury
26   47500.0     iPhone  Non-Luxury

In [31]:
## Forma 2
df.query('Income > 0')

      Income Phone_type  Class_type
0    89800.0    Android      Luxury
1    47500.0    Android  Non-Luxury
2    45000.0     iPhone      Luxury
3    44700.0        NaN      Luxury
4    59500.0     iPhone      Luxury
6    63300.0     iPhone  Non-Luxury
7    52900.0    Android      Luxury
8    78200.0    Android      Luxury
9   145100.0     iPhone      Luxury
10   88600.0     iPhone  Non-Luxury
11   65600.0     iPhone      Luxury
13   94600.0    Android      Luxury
14   59400.0     iPhone      Luxury
15   47300.0     iPhone  Non-Luxury
16   72100.0        NaN      Luxury
19   83000.0     iPhone      Luxury
20   64100.0    Android  Non-Luxury
21   42100.0     iPhone  Non-Luxury
23   91500.0     iPhone  Non-Luxury
24   51200.0    Android      Luxury
25   13800.0     iPhone  Non-Luxury
26   47500.0     iPhone  Non-Luxury

In [37]:
# Seleccionar las filas donde Income sea mayor que cero y Phone Type sea igual a Android
df[(df['Income']>0) & (df['Phone_type']=='Android')]

     Income Phone_type  Class_type
0   89800.0    Android      Luxury
1   47500.0    Android  Non-Luxury
7   52900.0    Android      Luxury
8   78200.0    Android      Luxury
13  94600.0    Android      Luxury
20  64100.0    Android  Non-Luxury
24  51200.0    Android      Luxury

# Datos Faltantes (Missing data)

In [31]:
# Verificar si hay datos faltantes por columna
df.isnull().any()

Income         True
Phone_type     True
Class_type    False
dtype: bool

In [40]:
# Numero de datos faltantes por columna
df.isnull().sum()

Income        2
Phone_type    2
Class_type    0
dtype: int64

In [41]:
# Max cantidad de datos faltantes para un registro
max(df.isnull().sum(axis=1))

1

In [43]:
# Eliminar todas las filas que tengan datos faltantes
df.dropna(axis=0) # cuando son filas no es neceario escribir axis=0

      Income Phone_type  Class_type
0    89800.0    Android      Luxury
1    47500.0    Android  Non-Luxury
2    45000.0     iPhone      Luxury
4    59500.0     iPhone      Luxury
6    63300.0     iPhone  Non-Luxury
7    52900.0    Android      Luxury
8    78200.0    Android      Luxury
9   145100.0     iPhone      Luxury
10   88600.0     iPhone  Non-Luxury
11   65600.0     iPhone      Luxury
13   94600.0    Android      Luxury
14   59400.0     iPhone      Luxury
15   47300.0     iPhone  Non-Luxury
17       0.0     iPhone  Non-Luxury
18       0.0    Android      Luxury
19   83000.0     iPhone      Luxury
20   64100.0    Android  Non-Luxury
21   42100.0     iPhone  Non-Luxury
22       0.0     iPhone      Luxury
23   91500.0     iPhone  Non-Luxury
24   51200.0    Android      Luxury
25   13800.0     iPhone  Non-Luxury
26   47500.0     iPhone  Non-Luxury

In [44]:
# Eliminar todas las columnas que tengan datos faltantes
df.dropna(axis=1)

    Class_type
0       Luxury
1   Non-Luxury
2       Luxury
3       Luxury
4       Luxury
5   Non-Luxury
6   Non-Luxury
7       Luxury
8       Luxury
9       Luxury
10  Non-Luxury
11      Luxury
12  Non-Luxury
13      Luxury
14      Luxury
15  Non-Luxury
16      Luxury
17  Non-Luxury
18      Luxury
19      Luxury
20  Non-Luxury
21  Non-Luxury
22      Luxury
23  Non-Luxury
24      Luxury
25  Non-Luxury
26  Non-Luxury

## Imputar datos faltantes

In [45]:
# Llenar los datos faltantes con el dato que nos interese
df.fillna(value=0)

      Income Phone_type  Class_type
0    89800.0    Android      Luxury
1    47500.0    Android  Non-Luxury
2    45000.0     iPhone      Luxury
3    44700.0          0      Luxury
4    59500.0     iPhone      Luxury
5        0.0    Android  Non-Luxury
6    63300.0     iPhone  Non-Luxury
7    52900.0    Android      Luxury
8    78200.0    Android      Luxury
9   145100.0     iPhone      Luxury
10   88600.0     iPhone  Non-Luxury
11   65600.0     iPhone      Luxury
12       0.0    Android  Non-Luxury
13   94600.0    Android      Luxury
14   59400.0     iPhone      Luxury
15   47300.0     iPhone  Non-Luxury
16   72100.0          0      Luxury
17       0.0     iPhone  Non-Luxury
18       0.0    Android      Luxury
19   83000.0     iPhone      Luxury
20   64100.0    Android  Non-Luxury
21   42100.0     iPhone  Non-Luxury
22       0.0     iPhone      Luxury
23   91500.0     iPhone  Non-Luxury
24   51200.0    Android      Luxury
25   13800.0     iPhone  Non-Luxury
26   47500.0     iPhone  Non-Luxury

In [ ]:
# Llenar los datos faltantes con el promedio de esa columna
df['Income'].fillna(value=df['Income'].mean())

0      89800.0
1      47500.0
2      45000.0
3      44700.0
4      59500.0
5      57872.0
6      63300.0
7      52900.0
8      78200.0
9     145100.0
10     88600.0
11     65600.0
12     57872.0
13     94600.0
14     59400.0
15     47300.0
16     72100.0
17         0.0
18         0.0
19     83000.0
20     64100.0
21     42100.0
22         0.0
23     91500.0
24     51200.0
25     13800.0
26     47500.0
Name: Income, dtype: float64

In [48]:
## Datos unicos

df['Phone_type'].unique()

array(['Android', 'iPhone', nan], dtype=object)

In [49]:
# Numero de valores unicos en el dataframe
df['Class_type'].nunique()

2

In [50]:
## Verificar Datos duplicados en todas las columnas
df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12     True
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
dtype: bool

In [51]:
## Eliminar Duplicados
df.drop_duplicates()

      Income Phone_type  Class_type
0    89800.0    Android      Luxury
1    47500.0    Android  Non-Luxury
2    45000.0     iPhone      Luxury
3    44700.0        NaN      Luxury
4    59500.0     iPhone      Luxury
5        NaN    Android  Non-Luxury
6    63300.0     iPhone  Non-Luxury
7    52900.0    Android      Luxury
8    78200.0    Android      Luxury
9   145100.0     iPhone      Luxury
10   88600.0     iPhone  Non-Luxury
11   65600.0     iPhone      Luxury
13   94600.0    Android      Luxury
14   59400.0     iPhone      Luxury
15   47300.0     iPhone  Non-Luxury
16   72100.0        NaN      Luxury
17       0.0     iPhone  Non-Luxury
18       0.0    Android      Luxury
19   83000.0     iPhone      Luxury
20   64100.0    Android  Non-Luxury
21   42100.0     iPhone  Non-Luxury
22       0.0     iPhone      Luxury
23   91500.0     iPhone  Non-Luxury
24   51200.0    Android      Luxury
25   13800.0     iPhone  Non-Luxury
26   47500.0     iPhone  Non-Luxury

## Estadistica Descriptiva

In [52]:
# Media Aritmetica
df.Income.mean()

np.float64(57872.0)

In [53]:
# Mediana
df.Income.median()

np.float64(59400.0)

In [ ]:
# Mediana
df.Income.max()

145100.0

In [54]:
# Minimo
df.Income.min()

np.float64(0.0)

In [55]:
# Moda
df.Income.mode()

0    0.0
Name: Income, dtype: float64

In [56]:
## Cantidad de datos por Phone_type

df.Phone_type.value_counts()

Phone_type
iPhone     15
Android    10
Name: count, dtype: int64

In [52]:
df[df['Income']>0]['Phone_type'].value_counts()

iPhone     13
Android     7
Name: Phone_type, dtype: int64

In [57]:
## Cantidad de datos por Class_type

df.Class_type.value_counts()

Class_type
Luxury        15
Non-Luxury    12
Name: count, dtype: int64

In [58]:
df.groupby('Phone_type')['Income'].sum().sort_values(ascending= False)

Phone_type
iPhone     851700.0
Android    478300.0
Name: Income, dtype: float64

## Medidas de dispersión

In [58]:
# Varianza
df.Income.var()

np.float64(1100254600.0)

In [59]:
# Desviación tipica o desviación estandar
df.Income.std()

np.float64(33170.085920901685)